# run `brew bundle`

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-drivers"

###########################
###### Brew Packages ######
###########################

####### Development #######
brew "cmake"
brew "go"
brew "mysql"
brew "ninja"
brew "wget"
brew "nvm" # more active than `n`

######## Utilities ########
brew "aria2"
brew "arp-scan"
brew "autojump"
brew "htop" # system status in terminal
brew "mackup"
brew "mas"
# brew "rmtrash" # replaced by `trash-cli`
brew "switchaudio-osx"
brew "tmux"
brew "tree"
# brew "vim" # don't use vim any more
brew "trash-cli" # avoid using `rm -rf`, need configure in .zshrc
brew "smartmontools" # monitor total read/write of SSD
brew "lsd" # improved `ls` command with icons
brew "duti" # set default app associated with filetypes

###########################
######## Brew Casks #######
###########################

# cask "qlmarkdown" # quick look tweaks for md file, not trusted any more
cask "skim" # Lightweight PDF Reader
cask "pdf-expert"
cask "spotify"
cask "hyperswitch"
cask "icons8"
cask "imazing"
cask "mactracker"
cask "mathpix-snipping-tool"
cask "mendeley"
cask "motrix"
cask "nightowl"
cask "soulver2"
cask "steam"
cask "typora"
# cask "setapp" # cannot install directly

##### Social Networks #####
cask "slack"
cask "signal"
cask "telegram"
cask "skype"
cask "discord"

########## Fonts ##########
cask "font-hack-nerd-font" # for `lsd` colorful icon ls
# Set nerd font for iTerm 
# [Icons render as  on MacOS · Issue #199 · Peltoche/lsd](https://github.com/Peltoche/lsd/issues/199#issuecomment-494218334)
# Set nerd font for VSCode
# [VSCode integrated terminal versus nerdfont-complete · Issue #672 · Powerlevel9k/powerlevel9k](https://github.com/Powerlevel9k/powerlevel9k/issues/672)
cask "font-source-code-pro"
cask "font-jetbrains-mono"

####### Development #######
# cask "docker" # not yet stable for M1
cask "iterm2" # terminal replacement
cask "miniconda" # python env management
# conda init "$(basename "${SHELL}")"
cask "tower" # git client
cask "visual-studio-code" # code editor
cask "kaleidoscope" # diff tool
cask "sublime-text" # faster editor

######## Utilities ########
cask "1password"
cask "carbon-copy-cloner"
cask "coconutbattery"
cask "daisydisk"
cask "detexify"
cask "displaylink"
# Audio
cask "airfoil"
cask "loopback"
cask "soundsource"
cask "blackhole-16ch" # virtual audio drive replacement for soundflower
# Network
cask "network-radar"
cask "surge"
cask "pingplotter"
cask "tunnelbear"
# Cloud Drive
cask "dropbox"
cask "weiyun"
# Photo & Images
cask "fastrawviewer"
cask "optimage"
cask "ppduck"
cask "retrobatch"
# Video
cask "iina"
cask "webex"
cask "zoomus"
cask "obs"
cask "reflector" # allow other devices to mirror videos via AirPlay
# Language
cask "anki"
cask "eudic" # dict app with .mdx
cask "grammarly"
cask "bob"
cask "deepl"
# Broswers
cask "115browser"
cask "google-chrome"
cask "brave-browser"

####### Productivity ######
cask "airtable"
cask "fantastical"
cask "obsidian"
cask "omnigraffle"
cask "notion"
cask "figma"
# Launcher & Shortcuts
cask "launchbar"
cask "raycast"
cask "keyboard-maestro"

###########################
######### MAS Apps ########
###########################

##### Safari Extension ####
mas "1Blocker", id: 1107421413
mas "Accelerate", id: 1459809092
mas "Dark Reader for Safari", id: 1438243180
mas "Grammarly for Safari", id: 1462114288
mas "Honey", id: 1472777122
mas "Instapaper Save", id: 1481302432
mas "Minimal Consent", id: 1514164630
mas "Price.com", id: 1424535163
mas "Raindrop.io for Safari", id: 957810159
mas "Translate for Safari", id: 1445040281
mas "Wayback Machine", id: 1472432422
mas "Save to Pocket", id: 1477385213

####### Productivity ######
mas "Bear", id: 1091189122
mas "Spark", id: 1176895641
mas "Drafts", id: 1435957248
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "WPS Office", id: 1443749478
mas "Notability", id: 736189492
mas "MindNode", id: 1289197285
mas "Pocket", id: 568494494
mas "Things", id: 904280696
# mas "Trello", id: 1278508951

####### Development #######
mas "Expressions", id: 913158085
mas "LanScan", id: 472226235
# mas "Xcode", id: 497799835 # takes too long
mas "Playgrounds", id: 1496833156

######## Lifestyle ########
mas "Day One", id: 1055511498
mas "MoneyWiz", id: 1511185140
mas "Habitify", id: 1140787122

######## Photography ######
mas "com.rawrightaway.showqlprefs", id: 963507809
mas "RAW Power", id: 1157116444 # raw photos management integrated with Apple Photos
mas "Pixelmator Pro", id: 1289583905

####### Social Media ######
mas "Tweetbot", id: 557168941
mas "Twitter", id: 1482454543
mas "WeChat", id: 836500024
mas "WhatsApp", id: 1147396723
mas "Messenger", id: 1480068668
mas "Maipo", id: 789066512
# mas "Reeder", id: 1449412482 # need to be installed with German Apple ID

###### Entertainment ######
mas "NeteaseMusic", id: 944848654
mas "优酷", id: 1014945607
mas "爱奇艺", id: 1012296988
mas "腾讯视频", id: 1231336508
mas "LyricsX", id: 1254743014

######## Utilities ########

mas "Capo", id: 696977615
mas "GarageBand", id: 682658836

mas "iText", id: 1314980676

mas "Disk Speed Test", id: 425264550
mas "Speedtest", id: 1153157709

mas "HazeOver", id: 430798174
mas "HyperDock", id: 449830122

mas "Duden German Dictionaries", id: 592995330
mas "YoudaoDict", id: 491854842
mas "iTranslate", id: 884952790

mas "ToothFairy", id: 1191449274
mas "RunCat", id: 1429033973

# mas "Marked 2", id: 890031187 # install with setapp

mas "Noizio", id: 928871589

mas "Tiger Trade", id: 1459728204
